In [33]:
dataset_id = "college3"

In [34]:
!bq --location=US mk --dataset $dataset_id

Dataset 'scohen-sandbox:college3' successfully created.

## Loading CSV files from Cloud Storage:

In [32]:
!bq \
    --location=US \
    load \
    --autodetect \
    --skip_leading_rows=1 \
    --source_format=CSV \
    {dataset_id}.Current_Student \
    'gs://bq_loads/Current_Students.csv'

BigQuery error in load operation: Cannot determine table described by
.Current_Student

In [7]:
!bq \
    --location=US \
    load \
    --autodetect \
    --skip_leading_rows=1 \
    --source_format=CSV \
    {dataset_id}.New_Students \
    'gs://bq_loads/New_Students.csv'

Waiting on bqjob_r7c72f716f95a3d63_0000016e5af4992c_1 ... (1s) Current status: DONE

In [12]:
!bq \
    --location=US \
    load \
    --autodetect \
    --skip_leading_rows=1 \
    --source_format=CSV \
    {dataset_id}.Classes \
    'gs://bq_loads/Classes.csv'

Waiting on bqjob_r5cce4773001d2aae_0000016e5af869cc_1 ... (2s) Current status: DONE

In [35]:
%%bigquery 
select count(*) from college2.Current_Students;

   f0_
0   11

In [36]:
%%bigquery 
select count(*) from college2.New_Students

   f0_
0    7

In [37]:
%%bigquery 
select count(*) from college2.Classes

   f0_
0   12

## Creating Modeled Tables:

In [17]:
modeled_dataset="college2_modeled"

In [18]:
!bq --location=US mk --dataset {modeled_dataset}

Dataset 'scohen-sandbox:college2_modeled' successfully created.

In [39]:
%%bigquery 
create or replace table college2_modeled.Student as
select distinct sid, fname, lname, dob
from college2.Current_Students 
union distinct
select distinct sid, fname, lname, cast(dob as string) as dob
from college2.New_Students;

Empty DataFrame
Columns: []
Index: []

In [25]:
%%bigquery
create table college2_modeled.Teacher as
select distinct tid, instructor, dept
from college2.Classes
where tid is not null
order by tid;

Empty DataFrame
Columns: []
Index: []

In [26]:
%%bigquery
create table college2_modeled.Class as
select distinct cno, cname, credits
from college2.Classes
where cno is not null
order by cno;

Empty DataFrame
Columns: []
Index: []

In [30]:
%%bigquery
create or replace table college2_modeled.Teaches as
select distinct tid, cno
from college2.Classes
where tid is not null
and cno is not null
order by tid;

Empty DataFrame
Columns: []
Index: []

In [31]:
%%bigquery
create table college2_modeled.Takes as
select distinct sid, cno, grade
from college2.Current_Students
where sid is not null
and cno is not null
order by sid;

Empty DataFrame
Columns: []
Index: []